glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC1700_DFP.pdsc
      <sequences>

        <sequence name="ResetCatchClear">
          <block>
            // System Control Space (SCS) offset as defined
            // in ARMv6-M/ARMv7-M. Reimplement this sequence
            // if the SCS is located at a different offset.
            __var SCS_Addr   = 0xE000E000;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var value      = 0;

            value = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, (value &amp; (~0x00000001)));                  // Disable Reset Vector Catch in DEMCR

            //Clear BP0 and FPB
            Write32(0xe0002008, 0);                                            // Clear BP0
            Write32(0xe0002000, 0x00000002);                                   // Disable FPB
          </block>
        </sequence>

        <sequence name="ResetCatchSet">
          <block>
            // System Control Space (SCS) offset as defined
            // in ARMv6-M/ARMv7-M. Reimplement this sequence
            // if the SCS is located at a different offset.
            __var SCS_Addr   = 0xE000E000;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var value      = 0;
            __var FPB_BKPT_H = 0x80000000;
            __var FPB_BKPT_L = 0x40000000;
            __var FPB_COMP_M = 0x1FFFFFFC;
            __var FPB_KEY    = 0x00000002;
            __var FPB_ENABLE = 0x00000001;

            value = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, (value | 0x00000001));                         // Enable Reset Vector Catch in DEMCR

            Read32(DHCSR_Addr);                                                // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
          </block>

          <control if="Dbg_CR &amp; 0x00000001" info="Stop after bootloader enabled">
            <block>
              // Run over Bootloader
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value &amp; (~0x00000001)));                // Disable Reset Vector Catch
              Write32(0x400FC040, 0x00000001);   			  			       // Map Flash to Vectors
              value = Read32 (0x00000004);           		  		           // Read Reset Vector
            </block>

            <control if="value &lt; 0x20000000" info="">
              <block>
                // Set BP0 to Reset Vector
                value = ((value &amp; 0x02) ? FPB_BKPT_H : FPB_BKPT_L) | (value &amp; FPB_COMP_M) | FPB_ENABLE ;
                Write32(0xE0002008, value);								       // Set BP0
                value = FPB_KEY | FPB_ENABLE;
                Write32(0xE0002000, value);								       // Enable FPB
              </block>
            </control>

          </control>
        </sequence>


		<sequence name="ResetHardwareDefault">
          <block>
            __var nReset      = 0x80;
            __var canReadPins = 0;

            // Deassert nRESET line
            canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
          </block>

          <!-- Keep reset active for 50 ms -->
          <control while="1" timeout="50000"/>

          <control if="canReadPins">
            <!-- Assert nRESET line and wait max. 1s for recovery -->
            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
          </control>

          <control if="!canReadPins">
            <block>
              // Assert nRESET line
              DAP_SWJ_Pins(nReset, nReset, 0);
            </block>
            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control while="1" timeout="100000"/>
          </control>
		</sequence>

        <sequence name="ResetSystemDefault">
          <block>
            // System Control Space (SCS) offset as defined in ARMv6-M/ARMv7-M.
            __var SCS_Addr   = 0xE000E000;
            __var AIRCR_Addr = SCS_Addr + 0xD0C;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;

            // Execute SYSRESETREQ via AIRCR
            Write32(AIRCR_Addr, 0x05FA0004);
          </block>
          <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
          <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) == 0" timeout="500000"/>
        </sequence>

        <sequence name="ResetProcessorDefault">
          <block>
            // System Control Space (SCS) offset as defined in ARMv7-M.
            __var SCS_Addr   = 0xE000E000;
            __var AIRCR_Addr = SCS_Addr + 0xD0C;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;

            // Execute VECTRESET via AIRCR
            Write32(AIRCR_Addr, 0x05FA0001);
          </block>

          <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
          <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) == 0" timeout="500000"/>
        </sequence>

		<sequence name="WaitForBootloader">
		  <block>
		    __var value = 0;
		  </block>
		  <control while="(Read32(0xE000EDF0) &amp; 0x02000000) == 0" timeout="500000"/>
		  <control if="(Read32(0xE000EDF0) &amp; 0x02000000) == 0">
		    <block>
			  // CPU still running (could be invalid user code) => Manually stop
			  value      = Read32(0xE000EDF0);
			  value &amp;= 0x0000FFFF;
			  value     |= 0xA05F0002;

			  Write32(0xE000EDF0, value);
			</block>

			<control while="(Read32(0xE000EDF0) &amp; 0x02000000) == 0" timeout="50000"/>

		  </control>
		</sequence>


		<sequence name="ResetHardware">
		  <block>
            __var SCS_Addr   = 0xE000E000;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
		    __var WasStopped = 0;

            // CPU State before reset
			WasStopped = (Read32(DHCSR_Addr) &amp; 0x00020000);

			// Execute Reset
			Sequence("ResetHardwareDefault");
		  </block>

		  <control if="WasStopped &amp;&amp; (Dbg_CR &amp; 0x00000001)" info="Run over bootloader enabled and CPU running">
		    <block>
			  Sequence("WaitForBootloader");
			</block>
		  </control>

		</sequence>

		<sequence name="ResetSystem">
		  <block>
            __var SCS_Addr   = 0xE000E000;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
		    __var WasStopped = 0;

            // CPU State before reset
			WasStopped = (Read32(DHCSR_Addr) &amp; 0x00020000);

			// Execute Reset
			Sequence("ResetSystemDefault");
		  </block>

		  <control if="WasStopped &amp;&amp; (Dbg_CR &amp; 0x00000001)" info="Run over bootloader enabled and CPU running">
		    <block>
			  Sequence("WaitForBootloader");
			</block>
		  </control>

		</sequence>

		<sequence name="ResetProcessor">
		  <block>
            __var SCS_Addr   = 0xE000E000;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
		    __var WasStopped = 0;

            // CPU State before reset
			WasStopped = (Read32(DHCSR_Addr) &amp; 0x00020000);

			// Execute Reset
			Sequence("ResetProcessorDefault");
		  </block>

		  <control if="WasStopped &amp;&amp; (Dbg_CR &amp; 0x00000001)" info="Run over bootloader enabled and CPU running">
		    <block>
			  Sequence("WaitForBootloader");
			</block>
		  </control>

		</sequence>

        <sequence name="DebugCodeMemRemap">
          <block>
            Write8 (0x400FC040, 0x01);
          </block>
        </sequence>

        <sequence name="TraceStart">
          <control if="__traceout &amp; 0x00000002" info="Parallel Trace Port selected">
            <block>
              // TPIU interface enabled (PINSEL10)
              Write32 (0x4002C028, 0x00000008);
            </block>
          </control>
        </sequence>

        <sequence name="TraceStop">
          <control if="__traceout &amp; 0x00000002" info="Parallel Trace Port selected">
            <block>
              // TPIU interface disabled (PINSEL10)
              Write32 (0x4002C028, 0x00000000);
            </block>
          </control>
        </sequence>

