glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC1700_DFP.pdsc
      <!-- *************************  Device 'LPC1788'  ***************************** -->
      <device Dname="LPC1788">
        <processor Dclock="120000000"/>
        <compile header="Device/Include/LPC177x_8x.h"  define="LPC177x_8x"/>
        <debug      svd="SVD/LPC178x7x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC178X_7X_UM.pdf"              title="LPC178x/7x User Manual"/>
        <book       name="Documents/LPC178X_7X.pdf"                 title="LPC178x Data Sheet"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>
      </subFamily>

    </family>
  </devices>

  <boards>
    <board vendor="Keil" name="MCB1700" revision="Ver 1.3" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB1760=ON">
      <description>Keil MCB1700 Development Board</description>
      <image small="Boards/Keil/MCB1700/Documentation/mcb1700_small.jpg"
             large="Boards/Keil/MCB1700/Documentation/mcb1700_large.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcb1700/" title="MCB1700 Evaluation Board Web Page"/>
      <book category="setup"     name="Boards/Keil/MCB1700/Documentation/MCB1700_QSG.pdf" title="MCB1700 Quick Start Guide"/>
      <book category="schematic" name="Boards/Keil/MCB1700/Documentation/mcb1700-schematics.pdf" title="MCB1700 Schematics"/>
      <book category="manual"    name="Boards/Keil/MCB1700/Documentation/mcb1700.chm" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC1758"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC1768"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC175x"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC176x"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="MemCard"         n="1"              name="microSD Card Holder"/>
      <feature type="Proto"           n="4"              name="Prototyping areas connected to I/Os"/>
      <feature type="DIO"             n="70"             name="Digital I/Os (depending on configuration)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Host/OTG interface (USB Host connector)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (USB Device connector)"/>
      <feature type="CAN"             n="2"/>
      <feature type="RS232"           n="2"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="ConnOther"       n="1"              name="Speaker with amplifier"/>
      <feature type="Button"          n="2"              name="Push-Buttons: Reset, INT0 (external interrupt)"/>
      <feature type="LED"             n="8"              name="I/O Port LEDs"/>
      <feature type="CustomFF"        n="120" m="120"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>

    <board vendor="Embedded Artists" name="LPC1788-32 Developers Kit" revision="Ver 1.3" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB1700=ON">
      <description>Embedded Artists LPC1788-32 Developers Kit</description>
      <image small="Boards/Embedded Artists/LPC1788-32 Developers Kit/Documentation/kit_lpc1788_small.jpg"
             large="Boards/Embedded Artists/LPC1788-32 Developers Kit/Documentation/kit_lpc1788_large.jpg"/>
      <book category="overview" name="http://www.embeddedartists.com/products/kits/lpc1788_kit.php" title="LPC1788-32 Developer's Kit Web Page"/>
      <book category="manual"   name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Documentation/LPC1788_OEM_Board_Users_Guide.pdf" title="LPC1788 Developer’s Kit User’s Guide"/>
      <book category="manual"   name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Documentation/LPC1788_OEM_Board_Datasheet_Rev_E.pdf" title="LPC1788 OEM Board Data Sheet"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC1788"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC178x"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="MemCard"         n="1"              name="microSD Card Holder"/>
      <feature type="Proto"           n="4"              name="Prototyping areas connected to I/Os"/>
      <feature type="DIO"             n="70"             name="Digital I/Os (depending on configuration)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Host/OTG interface (USB Host connector)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (USB Device connector)"/>
      <feature type="CAN"             n="2"/>
      <feature type="RS232"           n="2"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="ConnOther"       n="1"              name="Speaker with amplifier"/>
      <feature type="Button"          n="2"              name="Push-Buttons: Reset, INT0 (external interrupt)"/>
      <feature type="LED"             n="8"              name="I/O Port LEDs"/>
      <feature type="CustomFF"        n="120" m="120"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <conditions>

    <condition id="LPC175x">
      <description>NXP LPC1750 Series devices</description>
      <require Dname="LPC175*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="LPC176x">
      <description>NXP LPC1760 Series devices</description>
      <require Dname="LPC176*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="LPC177x">
      <description>NXP LPC1770 Series devices</description>
      <require Dname="LPC177*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

