glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC1700_DFP.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1.0" Cversion="2.8.0" condition="LPC177x_8x CMSIS PIN GPDMA">
      <description>UART Driver for LPC177x_8x Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART0              /* Driver USART0 */
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/UART_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1.0" Cversion="2.11.0" condition="LPC17xx Ethernet">
      <description>Ethernet MAC Driver for LPC1700 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/EMAC_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.2.0" Cversion="1.3.0" condition="LPC177x_8x CMSIS PIN GPIO GPDMA">
      <description>MCI Driver for LPC177x_8x Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/MCI_LPC177x_8x.c"/>
      </files>
    </component>

    <!-- MCB1700 Development Board -->
    <bundle Cbundle="MCB1700" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil Development Board MCB1700</description>
      <doc>Boards/Keil/MCB1700/Documentation/mcb1700.chm</doc>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="LPC1700 CMSIS PIN">
        <description>A/D Converter interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1700/Common/ADC_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="D/A Converter" Capiversion="1.0.0" condition="LPC1700 CMSIS PIN">
        <description>D/A Converter interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1700/Common/DAC_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="LPC1700 CMSIS PIN GPIO">
      <description>LED driver for Keil MCB1700 Development Board</description>
        <files>
        <file category="source" name="Boards/Keil/MCB1700/Common/LED_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC1700 CMSIS PIN GPIO">
        <description>Buttons interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1700/Common/Buttons_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="LPC1700 CMSIS PIN GPIO">
        <description>Joystick interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1700/Common/Joystick_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="LPC1700 CMSIS PIN GPIO GPDMA SPI">
        <description>Graphic LCD interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="header" name="Boards/Keil/MCB1700/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Keil/MCB1700/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Keil/MCB1700/Common/GLCD_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="SPI IF" condition="LPC1700 CMSIS PIN GPIO GPDMA SPI Display">
        <description>emWin LCD SPI Interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1700/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>
    <!-- LPC1788-32 Developers Kit -->
    <bundle Cbundle="LPC1788-32 Developers Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>Embedded Artists LPC1788-32 Developers Kit</description>
      <doc>Boards/Embedded Artists/LPC1788-32 Developers Kit/Documentation/LPC1788_OEM_Board_Users_Guide.pdf</doc>
        <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="LPC177x_8x CMSIS PIN">
        <description>A/D Converter interface for Embedded Artists LPC1788-32 Developers Kit</description>
        <files>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/ADC_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="LPC177x_8x CMSIS PIN I2C">
      <description>LED driver for Embedded Artists LPC1788-32 Developers Kit</description>
        <files>
        <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/LED_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC177x_8x CMSIS PIN I2C">
        <description>Buttons interface for Embedded Artists LPC1788-32 Developers Kit</description>
        <files>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/Buttons_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="LPC177x_8x CMSIS PIN GPIO">
        <description>Joystick interface for Embedded Artists LPC1788-32 Developers Kit</description>
        <files>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/Joystick_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" Cvariant="TFT 800x480" condition="LPC177x_8x CMSIS PIN GPIO I2C">
        <description>LCD Board rev PB1 "7 inch TFT 800x480" for Embedded Artists LPC1788-32 Developers Kit</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_EA_LCD_TFT_800x480
        </RTE_Components_h>
        <files>
          <file category="header" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_EA_LPC1788.c"/>
        </files>
      </component>
