glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC1700_DFP.pdsc
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" Cvariant="TFT 480x272" condition="LPC177x_8x CMSIS PIN GPIO I2C">
        <description>LCD Board rev PB1 "4.3 inch TFT 480x272" for Embedded Artists LPC1788-32 Developers Kit</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_EA_LCD_TFT_480x272
        </RTE_Components_h>
        <files>
          <file category="header" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" Cvariant="TFT 320x240" condition="LPC177x_8x CMSIS PIN GPIO GPDMA SPI">
        <description>LCD Board rev PB1 "3.2 inch TFT 320x240" for Embedded Artists LPC1788-32 Developers Kit</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_EA_LCD_TFT_320x240
        </RTE_Components_h>
        <files>
          <file category="header" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Capiversion="1.1.0" condition="LPC177x_8x CMSIS I2C SAI">
        <description>Audio interface for UDA1380</description>
        <files>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/Audio_UDA1380.c"/>
        </files>
      </component>
    </bundle>

  </components>
</package>
